tutorials/compressible/PBNS/cpbnsPIMPLE/forwardStep/constant/RASProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            laminar;

turbulence          off;

printCoeffs         off;

laminarCoeffs
{}

wallFunctionCoeffs
{
    kappa            0.4187;
    E                9;
}

// ************************************************************************* //
