tutorials/compressible/PBNS/cpbnsPIMPLE/forwardStep/0/T
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            zeroGradient;
    }

    defaultFaces    
    {
        type            empty;
    }
}

// ************************************************************************* //
